uhnp/src/AccumulationRegisters/ОперацииБюджетов/ОперацииБюджетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОперацииБюджетов</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Лимит</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СуммаИсполнено</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоИсполнено</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЛимитИсполнено</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникВерсии</name>
    <type>
      <types>DefinedType.ИсточникВерсии</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсЗаданВОперации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсПланирования</name>
    <type>
      <types>DefinedType.КурсВалюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КратностьПланирования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КурсЛимитирования</name>
    <type>
      <types>DefinedType.КурсВалюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КратностьЛимитирования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КорректировкаДокумента</name>
    <type>
      <types>DefinedType.КорректировкаДокумента</types>
    </type>
  </attributes>
  <dimensions>
    <name>ВидБюджета</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыБюджетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектПланирования</name>
    <type>
      <types>CatalogRef.ОбъектыПланирования</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостояниеПлана</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаСтруктуры</name>
    <type>
      <types>CatalogRef.КлючиАналитикиПланированияСтруктуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаСтатейБюджетов</name>
    <type>
      <types>CatalogRef.КлючиАналитикиПланированияСтатейБюджетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаНоменклатуры</name>
    <type>
      <types>CatalogRef.КлючиАналитикиПланированияНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаПотребностей</name>
    <type>
      <types>CatalogRef.КлючиАналитикиПланированияПотребностей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаПоставки</name>
    <type>
      <types>CatalogRef.КлючиАналитикиПланированияПоставки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаПартнеров</name>
    <type>
      <types>CatalogRef.КлючиАналитикиПланированияРасчетовСКонтрагентами</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПриходРасход</name>
    <type>
      <types>EnumRef.ВидыДвиженийПриходРасход</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВалютаЛимитирования</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

uhnp/src/InformationRegisters/ПараметрыЛимитирования/ПараметрыЛимитирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПараметрыЛимитирования</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ПериодичностьПланирования</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </resources>
  <resources>
    <name>ПериодичностьЛимитирования</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоПериодовЛимитирования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьЛимитирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьРезервирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СпособОпределенияВалютыЛимитирования</name>
    <type>
      <types>EnumRef.СпособыОпределенияВалютыЛимитирования</types>
    </type>
  </resources>
  <resources>
    <name>КонтрольЛимитов</name>
    <type>
      <types>EnumRef.РежимыКонтроляДокументов</types>
    </type>
  </resources>
  <resources>
    <name>КонтрольРезервов</name>
    <type>
      <types>EnumRef.РежимыКонтроляДокументов</types>
    </type>
  </resources>
  <resources>
    <name>УчитыватьАналитикиСтатьиБюджетаПриКонтроле</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВалютаПоУмолчанию</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>ПланированиеЗакупок</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РезервированиеВПериодичностиПланирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ВидБюджета</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыБюджетов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/ПараметрыКонтроляЛимитаСтатейБюджетов/ПараметрыКонтроляЛимитаСтатейБюджетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПараметрыКонтроляЛимитаСтатейБюджетов</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>КонтролироватьСтатью</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КонтролироватьАналитику1</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КонтролироватьАналитику2</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КонтролироватьАналитику3</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КонтролироватьАналитику4</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КонтролироватьАналитику5</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КонтролироватьАналитику6</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИноеДействие</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КонтрольЛимитов</name>
    <type>
      <types>EnumRef.РежимыКонтроляДокументов</types>
    </type>
  </resources>
  <resources>
    <name>КонтрольРезервов</name>
    <type>
      <types>EnumRef.РежимыКонтроляДокументов</types>
    </type>
  </resources>
  <dimensions>
    <name>ВидБюджета</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыБюджетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяБюджета</name>
    <type>
      <types>Characteristic.ВидыБюджетов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/ПараметрыЛимитированияГруппыСтатей/ПараметрыЛимитированияГруппыСтатей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПараметрыЛимитированияГруппыСтатей</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ИнаяПериодичность</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </resources>
  <resources>
    <name>КонтрольПоГруппе</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИноеДействие</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КонтрольЛимитов</name>
    <type>
      <types>EnumRef.РежимыКонтроляДокументов</types>
    </type>
  </resources>
  <resources>
    <name>КонтрольРезервов</name>
    <type>
      <types>EnumRef.РежимыКонтроляДокументов</types>
    </type>
  </resources>
  <dimensions>
    <name>ВидБюджета</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыБюджетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГруппаСтатей</name>
    <type>
      <types>CatalogRef.ГруппыСтатейБюджета</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/ПараметрыЛимитированияГруппыСтатейСостав/ПараметрыЛимитированияГруппыСтатейСостав.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПараметрыЛимитированияГруппыСтатейСостав</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ГруппаСтатей</name>
    <type>
      <types>CatalogRef.ГруппыСтатейБюджета</types>
    </type>
  </resources>
  <dimensions>
    <name>ВидБюджета</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыБюджетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяБюджета</name>
    <type>
      <types>Characteristic.ВидыБюджетов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Enums/РежимыКонтроляДокументов/РежимыКонтроляДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РежимыКонтроляДокументов</name>
  <enumValues>
    <name>Блокировать</name>
  </enumValues>
  <enumValues>
    <name>Информировать</name>
  </enumValues>
  <enumValues>
    <name>НеКонтролировать</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/Периодичность/Периодичность.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Периодичность</name>
  <comment>(Упр)(-УХМодульМенеджера)</comment>
  <enumValues>
    <name>День</name>
  </enumValues>
  <enumValues>
    <name>Неделя</name>
  </enumValues>
  <enumValues>
    <name>Декада</name>
  </enumValues>
  <enumValues>
    <name>Месяц</name>
  </enumValues>
  <enumValues>
    <name>Квартал</name>
  </enumValues>
  <enumValues>
    <name>Полугодие</name>
  </enumValues>
  <enumValues>
    <name>Год</name>
  </enumValues>
  <enumValues>
    <name>ДевятьМесяцев</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/CommonModules/КонтрольЛимитовФормы/Module.bsl
#Область СлужебныеПроцедурыИФункции

// Добавляет зависимое поле на форму.
//
// Параметры:
//  Форма			- ФормаКлиентскогоПриложения - форма
//  ИмяРеквизита	- Строка - Имя переключателя использования единого реквизита.
//  ЗависимыеПоля	- Строка - Список зависимых реквизитов, указанных через запятую.
//
Процедура ДобавитьЗависимостьПолей(Форма, ИмяРеквизита, ЗависимыеПоля) Экспорт
	
	Зависимые = СтрРазделить(ЗависимыеПоля,",",Ложь);
	
	Строка = Форма.ЗависимостиПолей.Добавить();
	Строка.ИмяРеквизита = ИмяРеквизита;
	Строка.ЗависимыеПоля = Новый ФиксированныйМассив(Зависимые);
	
КонецПроцедуры

#Область КорректировкаЛимитов

// Производит первоначальное заполнение единых реквизитов и зависимых реквизитов ТЧ для документов "Корректировка планов" и "Заявка на корректировку планов".
//
// Параметры:
//  Форма	- ФормаКлиентскогоПриложения - форма
//  ИмяТЧ	- Строка - Имя табличной части документа.
//
Процедура ОпределитьЕдиныеРеквизитыФормыКорректировкиЛимитов(Форма, ИмяТЧ) Экспорт

	Объект = Форма.Объект;
	//
	Колонки = Новый Массив;
	Колонки.Добавить("НачалоПериода");
	Колонки.Добавить("ЦФО");
	Колонки.Добавить("Проект");
	Колонки.Добавить("Валюта"); 
	Колонки.Добавить("ПриходРасход");
	
	ИменаЕдиныхРеквизитов = Новый Массив;
	ИменаЕдиныхРеквизитов.Добавить("ЕдиныйПериод");
	ИменаЕдиныхРеквизитов.Добавить("ЕдиныйЦФО"); 
	ИменаЕдиныхРеквизитов.Добавить("ЕдиныйПроект");
	ИменаЕдиныхРеквизитов.Добавить("ЕдинаяВалюта"); 
	ИменаЕдиныхРеквизитов.Добавить("ЕдиныйПриходРасход");
		
	ТребуетсяТаблица = Объект[ИмяТЧ].Выгрузить(, СтрСоединить(Колонки, ","));
	
	Для Индекс = 0 По Колонки.Количество()-1 Цикл
		СоставКолонки = Колонки[Индекс];
		ЕдиныйРеквизит = ИменаЕдиныхРеквизитов[Индекс];
		ДанныеКолонки = ТребуетсяТаблица.Скопировать(, СоставКолонки);
		ДанныеКолонки.Свернуть(СоставКолонки, "");
		Форма[ЕдиныйРеквизит] = ДанныеКолонки.Количество() = 1;
		Если Форма[ЕдиныйРеквизит] Тогда
			ЗаполнитьЗначенияСвойств(Форма, ДанныеКолонки[0], СоставКолонки);  
		Иначе
			Если ЕдиныйРеквизит = "ЕдиныйПериод" Тогда 
				Форма["НачалоПериода"] = Неопределено; 
				Форма["ПредставлениеПериода"] = Неопределено;
			ИначеЕсли ЕдиныйРеквизит = "ЕдиныйЦФО" Тогда
				Форма["ЦФО"] = Неопределено;  
			ИначеЕсли ЕдиныйРеквизит = "ЕдиныйПроект" Тогда
				Форма["Проект"] = Неопределено;
			ИначеЕсли ЕдиныйРеквизит = "ЕдинаяВалюта" Тогда
				Форма["Валюта"] = Неопределено;
			ИначеЕсли ЕдиныйРеквизит = "ЕдиныйПриходРасход" Тогда
				Форма["ПриходРасход"] = Неопределено;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры  

// Возвращает остаток свободного документа по строке для документов "Корректировка планов" и "Заявка на корректировку планов".
//
// Параметры:
//  СтруктураПараметров	- Структура - Структура параметров
//     * НачалоПериода	- Дата.
//     * Периоличность	- ПеречислениеСсылка.Периодичность.
//     * Валюта 		- СправочникСсылка.Валюты.
//     * ВидБюджета		- ПланВидовХарактеристикСсылка.ВидыБюджетов.
//     * Периоличность	- ПеречислениеСсылка.Периодичность.
//     * Проект			- СправочникСсылка.Проекты.
//     * СтатьяБюджета	- СправочникСсылка.СтатьиДвиженияДенежныхСредств.
//     * ЦФО			- СправочникСсылка.Организации.
Функция ЗаполнитьОстаткиСвободногоЛимитаПоСтрокеКорректировкаЛимитов(СтруктураПараметров) Экспорт
	
	Свободно = 0;
	
	Запрос = Новый Запрос;  
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеРегистра.Регистратор КАК Регистратор,
		|	ДанныеРегистра.Период КАК Период,
		|	ДанныеРегистра.ВидБюджета КАК ВидБюджета,
		|	ДанныеРегистра.ОбъектПланирования КАК ОбъектПланирования,
		|	ДанныеРегистра.АналитикаСтруктуры.ЦФО КАК ЦФО,
		|	ДанныеРегистра.АналитикаСтруктуры.Проект КАК Проект,
		|	ДанныеРегистра.АналитикаСтатейБюджетов.СтатьяБюджета КАК СтатьяБюджета,
		|	ДанныеРегистра.АналитикаСтатейБюджетов.Аналитика1 КАК Аналитика1,
		|	ДанныеРегистра.АналитикаСтатейБюджетов.Аналитика2 КАК Аналитика2,
		|	ДанныеРегистра.АналитикаСтатейБюджетов.Аналитика3 КАК Аналитика3,
		|	ДанныеРегистра.АналитикаСтатейБюджетов.Аналитика4 КАК Аналитика4,
		|	ДанныеРегистра.АналитикаСтатейБюджетов.Аналитика5 КАК Аналитика5,
		|	ДанныеРегистра.АналитикаСтатейБюджетов.Аналитика6 КАК Аналитика6,
		|	ДанныеРегистра.АналитикаСтатейБюджетов.ПриходРасход КАК ПриходРасход,
		|	ДанныеРегистра.Валюта КАК Валюта,
		|	ДанныеРегистра.ВалютаЛимитирования КАК ВалютаЛимитирования,
		|	ВЫБОР
		|		КОГДА ДанныеРегистра.ОбъектПланирования = ЗНАЧЕНИЕ(Справочник.ОбъектыПланирования.ПустаяСсылка)
		|				И НЕ ТИПЗНАЧЕНИЯ(ДанныеРегистра.Регистратор) В (&ТипыКорректировкиЛимитов)
		|			ТОГДА ДанныеРегистра.ЛимитОборот
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Лимит,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ДанныеРегистра.ОбъектПланирования.Объект) В (&ТипыЗаявокКОбеспечению)
		|			ТОГДА ДанныеРегистра.ЛимитОборот
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КОбеспечению,
		|	ВЫБОР
		|		КОГДА ДанныеРегистра.ОбъектПланирования = ЗНАЧЕНИЕ(Справочник.ОбъектыПланирования.ПустаяСсылка)
		|				И ТИПЗНАЧЕНИЯ(ДанныеРегистра.Регистратор) В (&ТипыКорректировкиЛимитов)
		|			ТОГДА ДанныеРегистра.ЛимитОборот
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Корректировка,
		|	ВЫБОР
		|		КОГДА ДанныеРегистра.ОбъектПланирования <> ЗНАЧЕНИЕ(Справочник.ОбъектыПланирования.ПустаяСсылка)
		|				И НЕ ДанныеРегистра.ОбъектПланирования.Объект ССЫЛКА Документ.ЗаявкаНаРасходованиеДенежныхСредств
		|			ТОГДА ДанныеРегистра.ЛимитОборот
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Зарезервировано,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ДанныеРегистра.ОбъектПланирования.Объект) В (&ТипыЗаявокНаОперации)
		|			ТОГДА ДанныеРегистра.ЛимитОборот
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Заявлено,
		|	ДанныеРегистра.ЛимитИсполненоОборот КАК Исполнено
		|ПОМЕСТИТЬ ВТ_Операции
		|ИЗ
		|	РегистрНакопления.ОперацииБюджетов.Обороты(
		|			&ДатаНачала,
		|			&ДатаОкончания,
		|			Регистратор,
		|			ВидБюджета = &ВидБюджета
		|				И Валюта = &Валюта
		|				И АналитикаСтруктуры.ЦФО = &ЦФО
		|				И АналитикаСтруктуры.Проект = &Проект
		|				И АналитикаСтатейБюджетов.СтатьяБюджета = &СтатьяБюджета) КАК ДанныеРегистра
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ОперацииБюджетов2Обороты.Период КАК Период,
		|	ОперацииБюджетов2Обороты.ВидБюджета КАК ВидБюджета
		|ПОМЕСТИТЬ ВТ_ВидыБюджетовДаты
		|ИЗ
		|	ВТ_Операции КАК ОперацииБюджетов2Обороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПараметрыЛимитирования.ВидБюджета КАК ВидБюджета,
		|	ПараметрыЛимитирования.Период КАК Период,
		|	ПараметрыЛимитирования.ПериодичностьЛимитирования КАК ПериодичностьЛимитирования,
		|	ПараметрыЛимитирования.ИспользоватьЛимитирование КАК ИспользоватьЛимитирование,
		|	ПараметрыЛимитирования.ИспользоватьРезервирование КАК ИспользоватьРезервирование,
		|	ПараметрыЛимитирования.КонтрольЛимитов КАК КонтрольЛимитов,
		|	ПараметрыЛимитирования.КонтрольРезервов КАК КонтрольРезервов,
		|	ВЫБОР
		|		КОГДА ПараметрыЛимитирования.КонтрольЛимитов = ЗНАЧЕНИЕ(Перечисление.РежимыКонтроляДокументов.Блокировать)
		|				ИЛИ ПараметрыЛимитирования.КонтрольЛимитов = ЗНАЧЕНИЕ(Перечисление.РежимыКонтроляДокументов.Информировать)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Контролировать,
		|	ПараметрыЛимитирования.СпособОпределенияВалютыЛимитирования КАК СпособОпределенияВалютыЛимитирования,
		|	КонстантаВалютаУправленческогоУчета.Значение КАК ВалютаУправленческогоУчета
		|ПОМЕСТИТЬ ВТ_ПараметрыЛимитирования
		|ИЗ
		|	РегистрСведений.ПараметрыЛимитирования КАК ПараметрыЛимитирования,
		|	Константа.ВалютаУправленческогоУчета КАК КонстантаВалютаУправленческогоУчета
		|ГДЕ
		|	ПараметрыЛимитирования.ВидБюджета = &ВидБюджета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ВидыБюджетовДаты.Период КАК Период,
		|	ВТ_ВидыБюджетовДаты.ВидБюджета КАК ВидБюджета,
		|	МАКСИМУМ(ВТ_ПараметрыЛимитирования.Период) КАК НачалоДействияПараметровЛимитирования
		|ПОМЕСТИТЬ ВТ_НачалоДействияПараметровЛимитирования
		|ИЗ
		|	ВТ_ВидыБюджетовДаты КАК ВТ_ВидыБюджетовДаты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПараметрыЛимитирования КАК ВТ_ПараметрыЛимитирования
		|		ПО ВТ_ВидыБюджетовДаты.ВидБюджета = ВТ_ПараметрыЛимитирования.ВидБюджета
		|			И ВТ_ВидыБюджетовДаты.Период >= ВТ_ПараметрыЛимитирования.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ВидыБюджетовДаты.ВидБюджета,
		|	ВТ_ВидыБюджетовДаты.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_НачалоДействияПараметровЛимитирования.ВидБюджета КАК ВидБюджета,
		|	ВТ_НачалоДействияПараметровЛимитирования.НачалоДействияПараметровЛимитирования КАК Период,
		|	ВТ_ПараметрыЛимитирования.ПериодичностьЛимитирования КАК ПериодичностьЛимитирования,
		|	ВТ_ПараметрыЛимитирования.ИспользоватьЛимитирование КАК ИспользоватьЛимитирование,
		|	ВТ_ПараметрыЛимитирования.ИспользоватьРезервирование КАК ИспользоватьРезервирование,
		|	ВТ_ПараметрыЛимитирования.КонтрольЛимитов КАК КонтрольЛимитов,
		|	ВТ_ПараметрыЛимитирования.КонтрольРезервов КАК КонтрольРезервов,
		|	ВТ_ПараметрыЛимитирования.Контролировать КАК Контролировать,
		|	ВТ_ПараметрыЛимитирования.СпособОпределенияВалютыЛимитирования КАК СпособОпределенияВалютыЛимитирования,
		|	ВТ_ПараметрыЛимитирования.ВалютаУправленческогоУчета КАК ВалютаУправленческогоУчета
		|ПОМЕСТИТЬ ВТ_ПараметрыЛимитированияВДействии
		|ИЗ
		|	ВТ_ПараметрыЛимитирования КАК ВТ_ПараметрыЛимитирования
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НачалоДействияПараметровЛимитирования КАК ВТ_НачалоДействияПараметровЛимитирования
		|		ПО ВТ_ПараметрыЛимитирования.ВидБюджета = ВТ_НачалоДействияПараметровЛимитирования.ВидБюджета
		|			И ВТ_ПараметрыЛимитирования.Период = ВТ_НачалоДействияПараметровЛимитирования.НачалоДействияПараметровЛимитирования
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПараметрыЛимитированияВДействии.ВидБюджета КАК ВидБюджета,
		|	ВТ_ПараметрыЛимитированияВДействии.Период КАК НачалоДействия,
		|	ПараметрыСтатей.СтатьяБюджета КАК СтатьяБюджета,
		|	ВЫБОР
		|		КОГДА ПараметрыСтатей.КонтрольЛимитов = ЗНАЧЕНИЕ(Перечисление.РежимыКонтроляДокументов.Блокировать)
		|				ИЛИ ПараметрыСтатей.КонтрольЛимитов = ЗНАЧЕНИЕ(Перечисление.РежимыКонтроляДокументов.Информировать)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Контролировать,
		|	ПараметрыСтатей.КонтролироватьАналитику1 КАК КонтролироватьАналитику1,
		|	ПараметрыСтатей.КонтролироватьАналитику2 КАК КонтролироватьАналитику2,
		|	ПараметрыСтатей.КонтролироватьАналитику3 КАК КонтролироватьАналитику3,
		|	ПараметрыСтатей.КонтролироватьАналитику4 КАК КонтролироватьАналитику4,
		|	ПараметрыСтатей.КонтролироватьАналитику5 КАК КонтролироватьАналитику5,
		|	ПараметрыСтатей.КонтролироватьАналитику6 КАК КонтролироватьАналитику6,
		|	ПараметрыСтатей.КонтрольЛимитов КАК КонтрольЛимитов,
		|	ПараметрыСтатей.КонтрольРезервов КАК КонтрольРезервов
		|ПОМЕСТИТЬ ВТ_ПараметрыЛимитированияСтатейБюджетов
		|ИЗ
		|	ВТ_ПараметрыЛимитированияВДействии КАК ВТ_ПараметрыЛимитированияВДействии
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыКонтроляЛимитаСтатейБюджетов КАК ПараметрыСтатей
		|		ПО ВТ_ПараметрыЛимитированияВДействии.ВидБюджета = ПараметрыСтатей.ВидБюджета
		|			И ВТ_ПараметрыЛимитированияВДействии.Период = ПараметрыСтатей.Период
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_ПараметрыЛимитированияВДействии.ВидБюджета,
		|	ВТ_ПараметрыЛимитированияВДействии.Период,
		|	ВТ_ВсеСтатьиБюджетов.СтатьяБюджета,
		|	ВЫБОР
		|		КОГДА ВТ_ПараметрыЛимитированияВДействии.КонтрольЛимитов = ЗНАЧЕНИЕ(Перечисление.РежимыКонтроляДокументов.Блокировать)
		|				ИЛИ ВТ_ПараметрыЛимитированияВДействии.КонтрольЛимитов = ЗНАЧЕНИЕ(Перечисление.РежимыКонтроляДокументов.Информировать)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ВТ_ПараметрыЛимитированияВДействии.КонтрольЛимитов,
		|	ВТ_ПараметрыЛимитированияВДействии.КонтрольРезервов
		|ИЗ
		|	ВТ_ПараметрыЛимитированияВДействии КАК ВТ_ПараметрыЛимитированияВДействии
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Операции КАК ВТ_ВсеСтатьиБюджетов
		|		ПО ВТ_ПараметрыЛимитированияВДействии.ВидБюджета = ВТ_ВсеСтатьиБюджетов.ВидБюджета
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыКонтроляЛимитаСтатейБюджетов КАК ПараметрыСтатей
		|		ПО (ПараметрыСтатей.ВидБюджета = &ВидБюджета)
		|			И ВТ_ПараметрыЛимитированияВДействии.Период = ПараметрыСтатей.Период
		|			И (ВТ_ВсеСтатьиБюджетов.СтатьяБюджета = ПараметрыСтатей.СтатьяБюджета)
		|ГДЕ
		|	ПараметрыСтатей.СтатьяБюджета ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПараметрыЛимитированияВДействии.ВидБюджета КАК ВидБюджета,
		|	ВТ_ПараметрыЛимитированияВДействии.Период КАК НачалоДействия,
		|	ПараметрыЛимитированияГруппыСтатейСостав.ГруппаСтатей КАК ГруппаСтатей,
		|	ПараметрыЛимитированияГруппыСтатейСостав.СтатьяБюджета КАК СтатьяБюджета,
		|	ПараметрыЛимитированияГруппыСтатей.ИнаяПериодичность КАК ИнаяПериодичность,
		|	ПараметрыЛимитированияГруппыСтатей.Периодичность КАК Периодичность,
		|	ПараметрыЛимитированияГруппыСтатей.КонтрольПоГруппе КАК КонтрольПоГруппе,
		|	ПараметрыЛимитированияГруппыСтатей.ИноеДействие КАК ИноеДействие,
		|	ПараметрыЛимитированияГруппыСтатей.КонтрольЛимитов КАК КонтрольЛимитов,
		|	ПараметрыЛимитированияГруппыСтатей.КонтрольРезервов КАК КонтрольРезервов,
		|	ВЫБОР
		|		КОГДА ПараметрыЛимитированияГруппыСтатей.ИноеДействие
		|				И (ПараметрыЛимитированияГруппыСтатей.КонтрольЛимитов = ЗНАЧЕНИЕ(Перечисление.РежимыКонтроляДокументов.Блокировать)
		|					ИЛИ ПараметрыЛимитированияГруппыСтатей.КонтрольЛимитов = ЗНАЧЕНИЕ(Перечисление.РежимыКонтроляДокументов.Информировать))
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Контролировать
		|ПОМЕСТИТЬ ВТ_ПараметрыЛимитированияГруппСтатей
		|ИЗ
		|	РегистрСведений.ПараметрыЛимитированияГруппыСтатей КАК ПараметрыЛимитированияГруппыСтатей
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыЛимитированияГруппыСтатейСостав КАК ПараметрыЛимитированияГруппыСтатейСостав
		|		ПО ПараметрыЛимитированияГруппыСтатей.ВидБюджета = ПараметрыЛимитированияГруппыСтатейСостав.ВидБюджета
		|			И ПараметрыЛимитированияГруппыСтатей.Период = ПараметрыЛимитированияГруппыСтатейСостав.Период
		|			И ПараметрыЛимитированияГруппыСтатей.ГруппаСтатей = ПараметрыЛимитированияГруппыСтатейСостав.ГруппаСтатей
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПараметрыЛимитированияВДействии КАК ВТ_ПараметрыЛимитированияВДействии
		|		ПО ПараметрыЛимитированияГруппыСтатей.ВидБюджета = ВТ_ПараметрыЛимитированияВДействии.ВидБюджета
		|			И ПараметрыЛимитированияГруппыСтатей.Период = ВТ_ПараметрыЛимитированияВДействии.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_ПараметрыЛимитированияГруппСтатей.ВидБюджета КАК ВидБюджета,
		|	ВТ_ПараметрыЛимитированияГруппСтатей.СтатьяБюджета КАК СтатьяБюджета,
		|	ВТ_ПараметрыЛимитированияГруппСтатей.НачалоДействия КАК НачалоДействия,
		|	ВЫБОР
		|		КОГДА ВТ_ПараметрыЛимитированияГруппСтатей.КонтрольПоГруппе
		|			ТОГДА ВТ_ПараметрыЛимитированияГруппСтатей.ГруппаСтатей
		|		ИНАЧЕ ВТ_ПараметрыЛимитированияГруппСтатей.СтатьяБюджета
		|	КОНЕЦ КАК ОбъектКонтроля,
		|	ВЫБОР
		|		КОГДА ВТ_ПараметрыЛимитированияГруппСтатей.ИнаяПериодичность
		|			ТОГДА ВТ_ПараметрыЛимитированияГруппСтатей.Периодичность
		|		ИНАЧЕ ВТ_ПараметрыЛимитированияВДействии.ПериодичностьЛимитирования
		|	КОНЕЦ КАК ПериодичностьКонтроля,
		|	ВЫБОР
		|		КОГДА ВТ_ПараметрыЛимитированияГруппСтатей.ИноеДействие
		|			ТОГДА ВТ_ПараметрыЛимитированияГруппСтатей.КонтрольЛимитов
		|		ИНАЧЕ ВТ_ПараметрыЛимитированияВДействии.КонтрольЛимитов
		|	КОНЕЦ КАК КонтрольЛимитов,
		|	ВЫБОР
		|		КОГДА ВТ_ПараметрыЛимитированияГруппСтатей.ИноеДействие
		|			ТОГДА ВТ_ПараметрыЛимитированияГруппСтатей.КонтрольРезервов
		|		ИНАЧЕ ВТ_ПараметрыЛимитированияВДействии.КонтрольРезервов
		|	КОНЕЦ КАК КонтрольРезервов,
		|	ВЫБОР
		|		КОГДА ВТ_ПараметрыЛимитированияГруппСтатей.ИноеДействие
		|			ТОГДА ВТ_ПараметрыЛимитированияГруппСтатей.Контролировать
		|		ИНАЧЕ ЕСТЬNULL(ВТ_ПараметрыЛимитированияСтатейБюджетов.Контролировать, ВТ_ПараметрыЛимитированияВДействии.Контролировать)
		|	КОНЕЦ КАК Контролировать,
		|	ВЫБОР
		|		КОГДА ВТ_ПараметрыЛимитированияГруппСтатей.КонтрольПоГруппе
		|				ИЛИ ВТ_ПараметрыЛимитированияГруппСтатей.СтатьяБюджета.ВидАналитики1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоКорпоративные.ПустаяСсылка)
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ВТ_ПараметрыЛимитированияСтатейБюджетов.КонтролироватьАналитику1
		|	КОНЕЦ КАК КонтролироватьАналитику1,
		|	ВЫБОР
		|		КОГДА ВТ_ПараметрыЛимитированияГруппСтатей.КонтрольПоГруппе
		|				ИЛИ ВТ_ПараметрыЛимитированияГруппСтатей.СтатьяБюджета.ВидАналитики2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоКорпоративные.ПустаяСсылка)
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ВТ_ПараметрыЛимитированияСтатейБюджетов.КонтролироватьАналитику2
		|	КОНЕЦ КАК КонтролироватьАналитику2,
		|	ВЫБОР
		|		КОГДА ВТ_ПараметрыЛимитированияГруппСтатей.КонтрольПоГруппе
		|				ИЛИ ВТ_ПараметрыЛимитированияГруппСтатей.СтатьяБюджета.ВидАналитики3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоКорпоративные.ПустаяСсылка)
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ВТ_ПараметрыЛимитированияСтатейБюджетов.КонтролироватьАналитику3
		|	КОНЕЦ КАК КонтролироватьАналитику3,
		|	ВЫБОР
		|		КОГДА ВТ_ПараметрыЛимитированияГруппСтатей.КонтрольПоГруппе
		|				ИЛИ ВТ_ПараметрыЛимитированияГруппСтатей.СтатьяБюджета.ВидАналитики4 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоКорпоративные.ПустаяСсылка)
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ВТ_ПараметрыЛимитированияСтатейБюджетов.КонтролироватьАналитику4
		|	КОНЕЦ КАК КонтролироватьАналитику4,
		|	ВЫБОР
		|		КОГДА ВТ_ПараметрыЛимитированияГруппСтатей.КонтрольПоГруппе
		|				ИЛИ ВТ_ПараметрыЛимитированияГруппСтатей.СтатьяБюджета.ВидАналитики5 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоКорпоративные.ПустаяСсылка)
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ВТ_ПараметрыЛимитированияСтатейБюджетов.КонтролироватьАналитику5
		|	КОНЕЦ КАК КонтролироватьАналитику5,
		|	ВЫБОР
		|		КОГДА ВТ_ПараметрыЛимитированияГруппСтатей.КонтрольПоГруппе
		|				ИЛИ ВТ_ПараметрыЛимитированияГруппСтатей.СтатьяБюджета.ВидАналитики6 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоКорпоративные.ПустаяСсылка)
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ВТ_ПараметрыЛимитированияСтатейБюджетов.КонтролироватьАналитику6
		|	КОНЕЦ КАК КонтролироватьАналитику6,
		|	ВТ_ПараметрыЛимитированияВДействии.СпособОпределенияВалютыЛимитирования КАК СпособОпределенияВалютыЛимитирования
		|ПОМЕСТИТЬ ВТ_ПараметрыЛимитированияСводно
		|ИЗ
		|	ВТ_ПараметрыЛимитированияГруппСтатей КАК ВТ_ПараметрыЛимитированияГруппСтатей
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПараметрыЛимитированияВДействии КАК ВТ_ПараметрыЛимитированияВДействии
		|		ПО ВТ_ПараметрыЛимитированияГруппСтатей.ВидБюджета = ВТ_ПараметрыЛимитированияВДействии.ВидБюджета
		|			И ВТ_ПараметрыЛимитированияГруппСтатей.НачалоДействия = ВТ_ПараметрыЛимитированияВДействии.Период
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПараметрыЛимитированияСтатейБюджетов КАК ВТ_ПараметрыЛимитированияСтатейБюджетов
		|		ПО ВТ_ПараметрыЛимитированияГруппСтатей.ВидБюджета = ВТ_ПараметрыЛимитированияСтатейБюджетов.ВидБюджета
		|			И ВТ_ПараметрыЛимитированияГруппСтатей.НачалоДействия = ВТ_ПараметрыЛимитированияСтатейБюджетов.НачалоДействия
		|			И ВТ_ПараметрыЛимитированияГруппСтатей.СтатьяБюджета = ВТ_ПараметрыЛимитированияСтатейБюджетов.СтатьяБюджета
		|			И (ВТ_ПараметрыЛимитированияГруппСтатей.КонтрольПоГруппе = ЛОЖЬ)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_ПараметрыЛимитированияСтатейБюджетов.ВидБюджета,
		|	ВТ_ПараметрыЛимитированияСтатейБюджетов.СтатьяБюджета,
		|	ВТ_ПараметрыЛимитированияСтатейБюджетов.НачалоДействия,
		|	ВТ_ПараметрыЛимитированияСтатейБюджетов.СтатьяБюджета,
		|	ВТ_ПараметрыЛимитированияВДействии.ПериодичностьЛимитирования,
		|	ВТ_ПараметрыЛимитированияСтатейБюджетов.КонтрольЛимитов,
		|	ВТ_ПараметрыЛимитированияСтатейБюджетов.КонтрольРезервов,
		|	ВТ_ПараметрыЛимитированияСтатейБюджетов.Контролировать,
		|	ВТ_ПараметрыЛимитированияСтатейБюджетов.КонтролироватьАналитику1,
		|	ВТ_ПараметрыЛимитированияСтатейБюджетов.КонтролироватьАналитику2,
		|	ВТ_ПараметрыЛимитированияСтатейБюджетов.КонтролироватьАналитику3,
		|	ВТ_ПараметрыЛимитированияСтатейБюджетов.КонтролироватьАналитику4,
		|	ВТ_ПараметрыЛимитированияСтатейБюджетов.КонтролироватьАналитику5,
		|	ВТ_ПараметрыЛимитированияСтатейБюджетов.КонтролироватьАналитику6,
		|	ВТ_ПараметрыЛимитированияВДействии.СпособОпределенияВалютыЛимитирования
		|ИЗ
		|	ВТ_ПараметрыЛимитированияСтатейБюджетов КАК ВТ_ПараметрыЛимитированияСтатейБюджетов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПараметрыЛимитированияГруппСтатей КАК ВТ_ПараметрыЛимитированияГруппСтатей
		|		ПО ВТ_ПараметрыЛимитированияСтатейБюджетов.ВидБюджета = ВТ_ПараметрыЛимитированияГруппСтатей.ВидБюджета
		|			И ВТ_ПараметрыЛимитированияСтатейБюджетов.СтатьяБюджета = ВТ_ПараметрыЛимитированияГруппСтатей.СтатьяБюджета
		|			И ВТ_ПараметрыЛимитированияСтатейБюджетов.НачалоДействия = ВТ_ПараметрыЛимитированияГруппСтатей.НачалоДействия
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПараметрыЛимитированияВДействии КАК ВТ_ПараметрыЛимитированияВДействии
		|		ПО ВТ_ПараметрыЛимитированияСтатейБюджетов.ВидБюджета = ВТ_ПараметрыЛимитированияВДействии.ВидБюджета
		|			И ВТ_ПараметрыЛимитированияСтатейБюджетов.НачалоДействия = ВТ_ПараметрыЛимитированияВДействии.Период
		|ГДЕ
		|	ВТ_ПараметрыЛимитированияГруппСтатей.СтатьяБюджета ЕСТЬ NULL
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ВидБюджета,
		|	НачалоДействия,
		|	СтатьяБюджета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПараметрыЛимитированияСводно.ПериодичностьКонтроля КАК Периодичность,
		|	ВЫБОР ПараметрыЛимитированияСводно.ПериодичностьКонтроля
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Неделя)
		|			ТОГДА НАЧАЛОПЕРИОДА(ВТ_Операции.Период, НЕДЕЛЯ)
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Декада)
		|			ТОГДА НАЧАЛОПЕРИОДА(ВТ_Операции.Период, ДЕКАДА)
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Месяц)
		|			ТОГДА НАЧАЛОПЕРИОДА(ВТ_Операции.Период, МЕСЯЦ)
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Квартал)
		|			ТОГДА НАЧАЛОПЕРИОДА(ВТ_Операции.Период, КВАРТАЛ)
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Полугодие)
		|			ТОГДА НАЧАЛОПЕРИОДА(ВТ_Операции.Период, ПОЛУГОДИЕ)
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Год)
		|			ТОГДА НАЧАЛОПЕРИОДА(ВТ_Операции.Период, ГОД)
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК НачалоПериода,
		|	ВТ_Операции.ВидБюджета КАК ВидБюджета,
		|	ВТ_Операции.ЦФО КАК ЦФО,
		|	ВТ_Операции.Проект КАК Проект,
		|	ВТ_Операции.СтатьяБюджета КАК СтатьяБюджета,
		|	ПараметрыЛимитированияСводно.ОбъектКонтроля КАК ОбъектКонтроля,
		|	ВЫБОР
		|		КОГДА ВТ_Операции.СтатьяБюджета = ПараметрыЛимитированияСводно.ОбъектКонтроля
		|				И ПараметрыЛимитированияСводно.КонтролироватьАналитику1
		|			ТОГДА ВТ_Операции.Аналитика1
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК Аналитика1,
		|	ВЫБОР
		|		КОГДА ВТ_Операции.СтатьяБюджета = ПараметрыЛимитированияСводно.ОбъектКонтроля
		|				И ПараметрыЛимитированияСводно.КонтролироватьАналитику2
		|			ТОГДА ВТ_Операции.Аналитика2
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК Аналитика2,
		|	ВЫБОР
		|		КОГДА ВТ_Операции.СтатьяБюджета = ПараметрыЛимитированияСводно.ОбъектКонтроля
		|				И ПараметрыЛимитированияСводно.КонтролироватьАналитику3
		|			ТОГДА ВТ_Операции.Аналитика3
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК Аналитика3,
		|	ВЫБОР
		|		КОГДА ВТ_Операции.СтатьяБюджета = ПараметрыЛимитированияСводно.ОбъектКонтроля
		|				И ПараметрыЛимитированияСводно.КонтролироватьАналитику4
		|			ТОГДА ВТ_Операции.Аналитика4
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК Аналитика4,
		|	ВЫБОР
		|		КОГДА ВТ_Операции.СтатьяБюджета = ПараметрыЛимитированияСводно.ОбъектКонтроля
		|				И ПараметрыЛимитированияСводно.КонтролироватьАналитику5
		|			ТОГДА ВТ_Операции.Аналитика5
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК Аналитика5,
		|	ВЫБОР
		|		КОГДА ВТ_Операции.СтатьяБюджета = ПараметрыЛимитированияСводно.ОбъектКонтроля
		|				И ПараметрыЛимитированияСводно.КонтролироватьАналитику6
		|			ТОГДА ВТ_Операции.Аналитика6
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК Аналитика6,
		|	ВТ_Операции.ПриходРасход КАК ПриходРасход,
		|	ВТ_Операции.ВалютаЛимитирования КАК Валюта,
		|	СУММА(ВТ_Операции.Лимит + ВТ_Операции.Корректировка - ВТ_Операции.Зарезервировано - ВТ_Операции.Заявлено - ВТ_Операции.Исполнено) КАК Свободно,
		|	ПараметрыЛимитированияСводно.КонтролироватьАналитику1 КАК КонтролироватьАналитику1,
		|	ПараметрыЛимитированияСводно.КонтролироватьАналитику2 КАК КонтролироватьАналитику2,
		|	ПараметрыЛимитированияСводно.КонтролироватьАналитику3 КАК КонтролироватьАналитику3,
		|	ПараметрыЛимитированияСводно.КонтролироватьАналитику4 КАК КонтролироватьАналитику4,
		|	ПараметрыЛимитированияСводно.КонтролироватьАналитику5 КАК КонтролироватьАналитику5,
		|	ПараметрыЛимитированияСводно.КонтролироватьАналитику6 КАК КонтролироватьАналитику6
		|ПОМЕСТИТЬ ВТ_Данные
		|ИЗ
		|	ВТ_Операции КАК ВТ_Операции
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НачалоДействияПараметровЛимитирования КАК ВТ_НачалоДействияПараметровЛимитирования
		|		ПО ВТ_Операции.ВидБюджета = ВТ_НачалоДействияПараметровЛимитирования.ВидБюджета
		|			И ВТ_Операции.Период = ВТ_НачалоДействияПараметровЛимитирования.Период
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПараметрыЛимитированияСводно КАК ПараметрыЛимитированияСводно
		|		ПО ВТ_Операции.ВидБюджета = ПараметрыЛимитированияСводно.ВидБюджета
		|			И ВТ_Операции.СтатьяБюджета = ПараметрыЛимитированияСводно.СтатьяБюджета
		|
		|СГРУППИРОВАТЬ ПО
		|	ПараметрыЛимитированияСводно.ПериодичностьКонтроля,
		|	ПараметрыЛимитированияСводно.ОбъектКонтроля,
		|	ВТ_Операции.СтатьяБюджета,
		|	ВЫБОР
		|		КОГДА ВТ_Операции.СтатьяБюджета = ПараметрыЛимитированияСводно.ОбъектКонтроля
		|				И ПараметрыЛимитированияСводно.КонтролироватьАналитику4
		|			ТОГДА ВТ_Операции.Аналитика4
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВТ_Операции.СтатьяБюджета = ПараметрыЛимитированияСводно.ОбъектКонтроля
		|				И ПараметрыЛимитированияСводно.КонтролироватьАналитику3
		|			ТОГДА ВТ_Операции.Аналитика3
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВТ_Операции.СтатьяБюджета = ПараметрыЛимитированияСводно.ОбъектКонтроля
		|				И ПараметрыЛимитированияСводно.КонтролироватьАналитику2
		|			ТОГДА ВТ_Операции.Аналитика2
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ВТ_Операции.ПриходРасход,
		|	ВЫБОР ПараметрыЛимитированияСводно.ПериодичностьКонтроля
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Неделя)
		|			ТОГДА КОНЕЦПЕРИОДА(ВТ_Операции.Период, НЕДЕЛЯ)
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Декада)
		|			ТОГДА КОНЕЦПЕРИОДА(ВТ_Операции.Период, ДЕКАДА)
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Месяц)
		|			ТОГДА КОНЕЦПЕРИОДА(ВТ_Операции.Период, МЕСЯЦ)
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Квартал)
		|			ТОГДА КОНЕЦПЕРИОДА(ВТ_Операции.Период, КВАРТАЛ)
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Полугодие)
		|			ТОГДА КОНЕЦПЕРИОДА(ВТ_Операции.Период, ПОЛУГОДИЕ)
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Год)
		|			ТОГДА КОНЕЦПЕРИОДА(ВТ_Операции.Период, ГОД)
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВТ_Операции.СтатьяБюджета = ПараметрыЛимитированияСводно.ОбъектКонтроля
		|				И ПараметрыЛимитированияСводно.КонтролироватьАналитику6
		|			ТОГДА ВТ_Операции.Аналитика6
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВТ_Операции.СтатьяБюджета = ПараметрыЛимитированияСводно.ОбъектКонтроля
		|				И ПараметрыЛимитированияСводно.КонтролироватьАналитику5
		|			ТОГДА ВТ_Операции.Аналитика5
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ВТ_Операции.ЦФО,
		|	ВТ_Операции.Проект,
		|	ВТ_Операции.ВидБюджета,
		|	ВЫБОР
		|		КОГДА ВТ_Операции.СтатьяБюджета = ПараметрыЛимитированияСводно.ОбъектКонтроля
		|				И ПараметрыЛимитированияСводно.КонтролироватьАналитику1
		|			ТОГДА ВТ_Операции.Аналитика1
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ВЫБОР ПараметрыЛимитированияСводно.ПериодичностьКонтроля
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Неделя)
		|			ТОГДА НАЧАЛОПЕРИОДА(ВТ_Операции.Период, НЕДЕЛЯ)
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Декада)
		|			ТОГДА НАЧАЛОПЕРИОДА(ВТ_Операции.Период, ДЕКАДА)
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Месяц)
		|			ТОГДА НАЧАЛОПЕРИОДА(ВТ_Операции.Период, МЕСЯЦ)
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Квартал)
		|			ТОГДА НАЧАЛОПЕРИОДА(ВТ_Операции.Период, КВАРТАЛ)
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Полугодие)
		|			ТОГДА НАЧАЛОПЕРИОДА(ВТ_Операции.Период, ПОЛУГОДИЕ)
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Год)
		|			ТОГДА НАЧАЛОПЕРИОДА(ВТ_Операции.Период, ГОД)
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ВТ_Операции.ВалютаЛимитирования,
		|	ПараметрыЛимитированияСводно.КонтролироватьАналитику1,
		|	ПараметрыЛимитированияСводно.КонтролироватьАналитику2,
		|	ПараметрыЛимитированияСводно.КонтролироватьАналитику3,
		|	ПараметрыЛимитированияСводно.КонтролироватьАналитику4,
		|	ПараметрыЛимитированияСводно.КонтролироватьАналитику5,
		|	ПараметрыЛимитированияСводно.КонтролироватьАналитику6
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Данные.Периодичность КАК Периодичность,
		|	ВТ_Данные.НачалоПериода КАК НачалоПериода,
		|	ВТ_Данные.ВидБюджета КАК ВидБюджета,
		|	ВТ_Данные.ЦФО КАК ЦФО,
		|	ВТ_Данные.Проект КАК Проект,
		|	ВТ_Данные.СтатьяБюджета КАК СтатьяБюджета,
		|	ВТ_Данные.ОбъектКонтроля КАК ОбъектКонтроля,
		|	ВТ_Данные.Аналитика1 КАК Аналитика1,
		|	ВТ_Данные.Аналитика2 КАК Аналитика2,
		|	ВТ_Данные.Аналитика3 КАК Аналитика3,
		|	ВТ_Данные.Аналитика4 КАК Аналитика4,
		|	ВТ_Данные.Аналитика5 КАК Аналитика5,
		|	ВТ_Данные.Аналитика6 КАК Аналитика6,
		|	ВТ_Данные.ПриходРасход КАК ПриходРасход,
		|	ВТ_Данные.Валюта КАК Валюта,
		|	ВТ_Данные.Свободно КАК Свободно,
		|	ВТ_Данные.КонтролироватьАналитику1 КАК КонтролироватьАналитику1,
		|	ВТ_Данные.КонтролироватьАналитику2 КАК КонтролироватьАналитику2,
		|	ВТ_Данные.КонтролироватьАналитику3 КАК КонтролироватьАналитику3,
		|	ВТ_Данные.КонтролироватьАналитику4 КАК КонтролироватьАналитику4,
		|	ВТ_Данные.КонтролироватьАналитику5 КАК КонтролироватьАналитику5,
		|	ВТ_Данные.КонтролироватьАналитику6 КАК КонтролироватьАналитику6
		|ИЗ
		|	ВТ_Данные КАК ВТ_Данные
		|ГДЕ
		|	ВТ_Данные.НачалоПериода <= &ДатаОкончания
		|	И ВТ_Данные.Свободно > 0
		|	И ВЫБОР
		|			КОГДА ВТ_Данные.КонтролироватьАналитику1
		|				ТОГДА ВТ_Данные.Аналитика1 = &Аналитика1
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА ВТ_Данные.КонтролироватьАналитику2
		|				ТОГДА ВТ_Данные.Аналитика2 = &Аналитика2
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА ВТ_Данные.КонтролироватьАналитику3
		|				ТОГДА ВТ_Данные.Аналитика3 = &Аналитика3
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА ВТ_Данные.КонтролироватьАналитику4
		|				ТОГДА ВТ_Данные.Аналитика4 = &Аналитика4
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА ВТ_Данные.КонтролироватьАналитику5
		|				ТОГДА ВТ_Данные.Аналитика5 = &Аналитика5
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА ВТ_Данные.КонтролироватьАналитику6
		|				ТОГДА ВТ_Данные.Аналитика6 = &Аналитика6
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ";
	
	ДатаНачала = СтруктураПараметров.НачалоПериода;
	ДатаОкончания = КэшируемыеПроцедурыУХ.ДатаКонцаПериода(СтруктураПараметров.НачалоПериода, СтруктураПараметров.Периодичность);

	Запрос.УстановитьПараметр("ВидБюджета", СтруктураПараметров.ВидБюджета); 
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);  
	Запрос.УстановитьПараметр("Валюта", СтруктураПараметров.Валюта);
	Запрос.УстановитьПараметр("ЦФО", СтруктураПараметров.ЦФО);
	Запрос.УстановитьПараметр("Проект", СтруктураПараметров.Проект);
    Запрос.УстановитьПараметр("СтатьяБюджета", СтруктураПараметров.СтатьяБюджета);   
	Запрос.УстановитьПараметр("Аналитика1", СтруктураПараметров.Аналитика1);
    Запрос.УстановитьПараметр("Аналитика2", СтруктураПараметров.Аналитика2);
	Запрос.УстановитьПараметр("Аналитика3", СтруктураПараметров.Аналитика3);
	Запрос.УстановитьПараметр("Аналитика4", СтруктураПараметров.Аналитика4);
	Запрос.УстановитьПараметр("Аналитика5", СтруктураПараметров.Аналитика5);
	Запрос.УстановитьПараметр("Аналитика6", СтруктураПараметров.Аналитика6);
	Запрос.УстановитьПараметр("ТипыЗаявокКОбеспечению", КонтрольЛимитовУХ.ТипыЗаявокКОбеспечению());
	Запрос.УстановитьПараметр("ТипыЗаявокНаОперации", КонтрольЛимитовУХ.ТипыЗаявокНаОперации());
	Запрос.УстановитьПараметр("ТипыКорректировкиЛимитов", КонтрольЛимитовУХ.ТипыКорректировкиЛимитов());
		
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Свободно = 0;
	Иначе;
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();  
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда  
			Свободно = ВыборкаДетальныеЗаписи.Свободно;	
		КонецЕсли; 
	КонецЕсли;	
	
	Возврат Свободно;
	
КонецФункции

#КонецОбласти

#КонецОбласти
